; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v7 ?v12)
             (pred_8 ?v9 ?v10)
             (pred_5 ?v7 ?v10)
             (pred_1 ?v3 ?v7 )
	     (pred_4 ?v7)
             (pred_9 ?v11)
             (pred_7 ?v9)
             (pred_3 ?v10)
             (pred_10 ?v7)
             (pred_12 ?v9)
             (pred_2 ?v7)
             (pred_6 ))



(:action op_2
:parameters (?v5 ?v1 ?v13 ?v6)
:precondition (and (pred_9 ?v5) (pred_9 ?v1) (pred_7 ?v13) (pred_3 ?v6)
          (pred_11 ?v5 ?v1) (pred_8 ?v13 ?v6)
                   (pred_5 ?v1 ?v6) (pred_4 ?v5) 
                   (pred_10 ?v1) (pred_12 ?v13))
:effect (and  (pred_2 ?v1) (not (pred_10 ?v1))))


(:action op_3
:parameters (?v5 ?v2)
:precondition (and (pred_9 ?v5) (pred_9 ?v2)
               (pred_4 ?v5) (pred_11 ?v5 ?v2) (pred_2 ?v2))
:effect (and (pred_4 ?v2) (not (pred_4 ?v5))))

(:action op_4
:parameters (?v5 ?v13)
:precondition (and (pred_9 ?v5) (pred_7 ?v13) 
                  (pred_4 ?v5) (pred_1 ?v13 ?v5) (pred_6 ))
:effect (and (pred_12 ?v13)
   (not (pred_1 ?v13 ?v5)) (not (pred_6 ))))


(:action op_5
:parameters (?v5 ?v4 ?v8)
:precondition (and (pred_9 ?v5) (pred_7 ?v4) (pred_7 ?v8)
                  (pred_4 ?v5) (pred_12 ?v8) (pred_1 ?v4 ?v5))
:effect (and (pred_12 ?v4) (pred_1 ?v8 ?v5)
        (not (pred_12 ?v8)) (not (pred_1 ?v4 ?v5))))

(:action op_1
:parameters (?v5 ?v13)
:precondition (and (pred_9 ?v5) (pred_7 ?v13) 
                  (pred_4 ?v5) (pred_12 ?v13))
:effect (and (pred_6 ) (pred_1 ?v13 ?v5) (not (pred_12 ?v13)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_06 obj_25 obj_23 obj_24 obj_14 obj_03 obj_30 obj_11 obj_12 obj_09 obj_28 obj_27 obj_05 obj_15 obj_10 obj_17 obj_08 obj_26 obj_22 obj_07 obj_13 obj_16 obj_01 obj_19
    obj_20 obj_04
    obj_29 obj_02 obj_18
    )

    (:init
       (pred_6)

       (pred_9 obj_21)
       (pred_9 obj_06)
       (pred_9 obj_25)
       (pred_9 obj_23)
       (pred_9 obj_24)
       (pred_9 obj_14)
       (pred_9 obj_03)
       (pred_9 obj_30)
       (pred_9 obj_11)
       (pred_9 obj_12)
       (pred_9 obj_09)
       (pred_9 obj_28)
       (pred_9 obj_27)
       (pred_9 obj_05)
       (pred_9 obj_15)
       (pred_9 obj_10)
       (pred_9 obj_17)
       (pred_9 obj_08)
       (pred_9 obj_26)
       (pred_9 obj_22)
       (pred_9 obj_07)
       (pred_9 obj_13)
       (pred_9 obj_16)
       (pred_9 obj_01)
       (pred_9 obj_19)
       (pred_3 obj_20)
       (pred_3 obj_04)
       (pred_7 obj_29)
       (pred_7 obj_02)
       (pred_7 obj_18)

       (pred_11 obj_21 obj_14)
       (pred_11 obj_21 obj_06)
       (pred_11 obj_06 obj_03)
       (pred_11 obj_06 obj_25)
       (pred_11 obj_06 obj_21)
       (pred_11 obj_25 obj_30)
       (pred_11 obj_25 obj_23)
       (pred_11 obj_25 obj_06)
       (pred_11 obj_23 obj_11)
       (pred_11 obj_23 obj_24)
       (pred_11 obj_23 obj_25)
       (pred_11 obj_24 obj_12)
       (pred_11 obj_24 obj_23)
       (pred_11 obj_14 obj_09)
       (pred_11 obj_14 obj_03)
       (pred_11 obj_14 obj_21)
       (pred_11 obj_03 obj_28)
       (pred_11 obj_03 obj_30)
       (pred_11 obj_03 obj_06)
       (pred_11 obj_03 obj_14)
       (pred_11 obj_30 obj_27)
       (pred_11 obj_30 obj_11)
       (pred_11 obj_30 obj_25)
       (pred_11 obj_30 obj_03)
       (pred_11 obj_11 obj_05)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_11 obj_23)
       (pred_11 obj_11 obj_30)
       (pred_11 obj_12 obj_15)
       (pred_11 obj_12 obj_24)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_09 obj_10)
       (pred_11 obj_09 obj_28)
       (pred_11 obj_09 obj_14)
       (pred_11 obj_28 obj_17)
       (pred_11 obj_28 obj_27)
       (pred_11 obj_28 obj_03)
       (pred_11 obj_28 obj_09)
       (pred_11 obj_27 obj_08)
       (pred_11 obj_27 obj_05)
       (pred_11 obj_27 obj_30)
       (pred_11 obj_27 obj_28)
       (pred_11 obj_05 obj_26)
       (pred_11 obj_05 obj_15)
       (pred_11 obj_05 obj_11)
       (pred_11 obj_05 obj_27)
       (pred_11 obj_15 obj_22)
       (pred_11 obj_15 obj_12)
       (pred_11 obj_15 obj_05)
       (pred_11 obj_10 obj_07)
       (pred_11 obj_10 obj_17)
       (pred_11 obj_10 obj_09)
       (pred_11 obj_17 obj_13)
       (pred_11 obj_17 obj_08)
       (pred_11 obj_17 obj_28)
       (pred_11 obj_17 obj_10)
       (pred_11 obj_08 obj_16)
       (pred_11 obj_08 obj_26)
       (pred_11 obj_08 obj_27)
       (pred_11 obj_08 obj_17)
       (pred_11 obj_26 obj_01)
       (pred_11 obj_26 obj_22)
       (pred_11 obj_26 obj_05)
       (pred_11 obj_26 obj_08)
       (pred_11 obj_22 obj_19)
       (pred_11 obj_22 obj_15)
       (pred_11 obj_22 obj_26)
       (pred_11 obj_07 obj_13)
       (pred_11 obj_07 obj_10)
       (pred_11 obj_13 obj_16)
       (pred_11 obj_13 obj_17)
       (pred_11 obj_13 obj_07)
       (pred_11 obj_16 obj_01)
       (pred_11 obj_16 obj_08)
       (pred_11 obj_16 obj_13)
       (pred_11 obj_01 obj_19)
       (pred_11 obj_01 obj_26)
       (pred_11 obj_01 obj_16)
       (pred_11 obj_19 obj_22)
       (pred_11 obj_19 obj_01)
       (pred_10 obj_24)
       (pred_10 obj_07)
       (pred_10 obj_10)
       (pred_5  obj_24 obj_20)
       (pred_5  obj_07 obj_04)
       (pred_5  obj_10 obj_04)
       (pred_2 obj_21)
       (pred_2 obj_06)
       (pred_2 obj_25)
       (pred_2 obj_23)
       (pred_2 obj_14)
       (pred_2 obj_03)
       (pred_2 obj_30)
       (pred_2 obj_11)
       (pred_2 obj_12)
       (pred_2 obj_09)
       (pred_2 obj_28)
       (pred_2 obj_27)
       (pred_2 obj_05)
       (pred_2 obj_15)
       (pred_2 obj_17)
       (pred_2 obj_08)
       (pred_2 obj_26)
       (pred_2 obj_22)
       (pred_2 obj_13)
       (pred_2 obj_16)
       (pred_2 obj_01)
       (pred_2 obj_19)

       (pred_8  obj_29 obj_20)
       (pred_8  obj_02 obj_04)
       (pred_8  obj_18 obj_20)
       (pred_1 obj_29 obj_22)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_18 obj_28)
       (pred_4 obj_08)
    )

    (:goal (and
       (pred_1 obj_29 obj_03)
       (pred_1 obj_02 obj_05)
    ))
(:constraints
  (always (not (pred_4 obj_17)))
)
)

; plan
1. (op_3 obj_08 obj_16)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_16)
   goals met: 0 of 2
2. (op_3 obj_16 obj_13)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_13)
   goals met: 0 of 2
3. (op_4 obj_13 obj_02)
   deleted: (pred_1 obj_02 obj_13) (pred_6)
   added: (pred_12 obj_02)
   goals met: 0 of 2
4. (op_3 obj_13 obj_16)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_16)
   goals met: 0 of 2
5. (op_3 obj_16 obj_08)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_08)
   goals met: 0 of 2
6. (op_3 obj_08 obj_26)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_26)
   goals met: 0 of 2
7. (op_3 obj_26 obj_05)
   deleted: (pred_4 obj_26)
   added: (pred_4 obj_05)
   goals met: 0 of 2
8. (op_1 obj_05 obj_02)
   deleted: (pred_12 obj_02)
   added: (pred_6) (pred_1 obj_02 obj_05)
   goals met: 1 of 2
9. (op_3 obj_05 obj_15)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_15)
   goals met: 1 of 2
10. (op_3 obj_15 obj_22)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_22)
   goals met: 1 of 2
11. (op_4 obj_22 obj_29)
   deleted: (pred_1 obj_29 obj_22) (pred_6)
   added: (pred_12 obj_29)
   goals met: 1 of 2
12. (op_3 obj_22 obj_15)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_15)
   goals met: 1 of 2
13. (op_3 obj_15 obj_12)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_12)
   goals met: 1 of 2
14. (op_3 obj_12 obj_11)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_11)
   goals met: 1 of 2
15. (op_3 obj_11 obj_30)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_30)
   goals met: 1 of 2
16. (op_3 obj_30 obj_03)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_03)
   goals met: 1 of 2
17. (op_1 obj_03 obj_29)
   deleted: (pred_12 obj_29)
   added: (pred_6) (pred_1 obj_29 obj_03)
   goals met: 2 of 2
